import React from "react";
import styles from "./HomePage.module.scss";
import welcome from "../../images/HomePage/welcome.png";
import security from "../../images/HomePage/security.png";

const HomePage = () => {
  return (
    <>
      <p className={styles.TitlePage}>
        Вас вітає інтернет магазин <span>Продавай та купуй!</span>
      </p>
      <div className={styles.CardContainer}>
        <div className={styles.Welcome}>
          <div className={styles.TextBoxLeft}>
            <p>
              Вітаємо вас у нашому онлайн-магазині! Раді бачити вас тут, де мрії
              стають реальністю. Ми прагнемо зробити вашу шопінг-пригоду
              незабутньою та зручною. Наша команда працює неутомно, щоб вам було
              зручно переглядати широкий асортимент товарів і знаходити саме те,
              що вам потрібно.
            </p>
            <img className={styles.WelcomeImage} src={welcome} alt="Вітаємо!" />
            <p>
              Тут ви знайдете найсвіжіші тренди моди, якісні електроніку,
              функціональні товари для дому, стильні аксесуари і багато іншого.
              Наші товари відібрані з урахуванням вашого комфорту та
              задоволення.
            </p>
            <p>
              Ми пишаємося нашою високою якістю обслуговування та надаємо
              надійні гарантії на всі наші товари. Наша мета - зробити вас
              щасливими та задоволеними нашими продуктами.
            </p>
            <p>
              Не соромтеся звертатися до нашої допомоги, якщо вам потрібна
              будь-яка підтримка або консультація. Ми завжди тут, щоб допомогти
              вам зробити правильний вибір.
            </p>
            <p>
              Дякуємо, що ви обрали нас. Бажаємо вам приємних покупок та
              незабутнього досвіду шопінгу. Залишайтеся з нами і отримуйте
              задоволення від покупок!
            </p>
            <p>
              З найкращими побажаннями!
              <br /> Команда нашого інтернет-магазину!
            </p>
          </div>
          <div className={styles.TextBoxRight}>
            <p>
              Ми хотіли б наголосити наш пріоритет щодо безпеки та захисту даних
              в нашому інтернет-магазині. Ми розуміємо, що важливо мати
              впевненість у безпеці під час покупок онлайн, тому ми вживаємо ряд
              заходів для забезпечення вашого захисту.
            </p>
            <p>
              1. Конфіденційність даних: Ми дуже серйозно ставимося до захисту
              вашої особистої інформації. Ми використовуємо передові технології
              шифрування, щоб забезпечити безпеку передачі даних між вами та
              нашим сервером. Ми ніколи не передаємо ваші особисті дані третім
              особам без вашої згоди.
            </p>
            <p>
              2. Безпека платежів: Наш інтернет-магазин працює з провідними
              платіжними платформами, які мають високий рівень безпеки. Ваші
              фінансові дані, такі як номери кредитних карток, обробляються
              безпечно і зашифровано, щоб максимально знизити ризик
              несанкціонованого доступу до них.
            </p>
            <p>
              3. Захист від шахрайства: Ми використовуємо системи виявлення
              шахрайства та моніторимо транзакції, щоб запобігти будь-яким
              підозрілим активностям. Якщо ми виявимо будь-які підозрілі дії, ми
              вживемо відповідних заходів, включаючи зв'язок з вами для
              перевірки.
            </p>
            <img className={styles.WelcomeImage} src={security} alt="Безпека" />
            <p>
              4. Антивірусний захист: Ми регулярно оновлюємо та перевіряємо наші
              системи на наявність вірусів та шкідливих програм. Ми прагнемо
              забезпечити безпеку вашого пристрою під час відвідування нашого
              сайту.
            </p>
          </div>
        </div>
        <div></div>
        <div></div>
      </div>
    </>
  );
};

export default HomePage;
